<?php
// +----------------------------------------------------------------------
// | Class  系统配置
// +----------------------------------------------------------------------
// | Copyright (c) 2022
// +----------------------------------------------------------------------

return array(
    'SYS_APP_PATH' => 'app',        // 应用路径
    'SYS_APP_DEFAULT' => 'w',   // 指向默认模块
    'SYS_DEBUG' => true,           // 调试开关
    'SYS_DEBUG_LOG' => true,       // 系统日志开关
    'SYS_PAGE404' => false,          // 404页面开关
    'SYS_URL_BOGUS' => true,       // 伪静态开关
    'SYS_APP_URL_FIX' => '.html',   // 伪静态后缀初始值
    'SYS_VISIT_SAFE' => true,      // 安全访问监控开关
    'SYS_LOG_PATH' => 'runtime/logs/',      // 日志目录
);